//
//  QuestionsDataModel.swift
//  SM8.0-Challange1-Bomb
//
//  Created by Ilyas Tyumenev on 11.08.2023.
//

import Foundation

struct QuestionsDataModel {
    
    static let sportAndHobby: [String] = [
        "Назовите вид спорта с мячом",
        "Назовите вид спорта в летних Олимпийских играх",
        "Назовите вид спорта в зимних Олимпийских играх",
        "Назовите жанр видеоигры",
        "Назовите экстремальный вид активности",
        "Назовите музыкальный инструмент",
        "Назовите вид спорта с катанием на доске",
        "Назовите вид танцев",
        "Назовите зимний вид спорта",
        "Назовите вид спорта на льду",
        "Назовите игру, в которой бьют мячик ракеткой через сетку",
        "Назовите вид спорта на ринге",
        "Назовите спортивное состязание на воде",
        "Назовите вид единоборств",
        "Назовите вид спорта на открытом воздухе"
    ]
    
    static let fameos: [String] = [
        "Назовите актера/актрису из фильма «12 друзей Оушена»",
        "Назовите певицу, победившую в конкурсе «Евровидение»",
        "Назовите актера, сыгравшего Джеймса Бонда",
        "Назовите актера из серии фильмов о Гарри Поттере",
        "Назовите советского космонавта",
        "Назовите известного рок-музыканта",
        "Назовите фильм Квентина Тарантино",
        "Назовите президента, изображенного на банкноте с американскими долларами",
        "Назовите актера из фильма «Властелин колец»",
        "Назовите одного из самых богатых музыкантов в мире",
        "Назовите одного из списка самых привлекательных мужчин в мире",
        "Назовите одну из списка самых привлекательных женщин в мире",
        "Назовите футболиста, известного на весь мир",
        "Назовите легенду мирового бокса",
        "Назовите актера из фильма «Неудержимые»"
    ]
    
    static let artAndCinema: [String] = [
        "Назовите фильм, являющийся классикой мирового кино",
        "Назовите картину, получившую премию Оскара",
        "Назовите древний вид искусства",
        "Назовите актера, считающегося иконой Голливуда",
        "Назовите искусство, которое считается высоко оцененным",
        "Назовите актрису, ставшую популярной благодаря своей внешности",
        "Назовите известного художника 20 века",
        "Назовите актера, совершившего впечатляющую трансформацию для роли",
        "Назовите фильм с невероятным коммерческим успехом",
        "Назовите жанр в изобразительном искусстве",
        "Назовите жанр художественного кино",
        "Назовите вид искусства",
        "Назовите фильм, ставший символом своей эпохи",
        "Назовите искусство, использующееся для самовыражения",
        "Назовите картину, ставшую символам прекрасного искусства"
    ]
    
    static let nature: [String] = [
        "Назовите многолетнее дерево",
        "Назовите птицу, которая мигрирует сезонно",
        "Назовите ядовитое растение",
        "Назовите хищную рыбу",
        "Назовите хищное наземное млекопитающее",
        "Назовите хищное водное млекопитающее",
        "Назовите птицу, летающую в группе сородичей",
        "Назовите природное явление на воде",
        "Назовите животное, считающееся исчезающим видом",
        "Назовите животное, обитающее в пустыне",
        "Назовите ядовитого паука",
        "Назовите растение, которое используется в медицинской промышленности",
        "Назовите животное, из меха которого производят шубу",
        "Назовите животное, которое способно охотиться ночью",
        "Назовите животное, которое может менять свою окраску"
    ]
}
