import Foundation

struct TasksDataModel {
    
    static let tasks: [String] = [
        "Рассказать анекдот",
        "Выпить стакан воды",
        "Отжаться 20 раз",
        "Прочесть отрывок из стихотворения",
        "Спеть отрывок из любимой песни",
        "Рассказать скороговорку без запинок, если запнулся, то начать заново",
        "Выдернуть волос из головы, руки, носа или другого места",
        "Покатать на спине подругу или того, кто пожелает",
        "Позвонить по незнакомому номеру и признаться в любви тому, кто ответит",
        "Каждому игроку разрешить себя пощекотать",
        "Каждому игроку разрешить дать щелбан",
        "Позвать Галю в пятёрочке для отмены",
        "Записаться добровольцем на следующий городской субботник",
        "Оплатить такси до дома всем участникам"
    ]
}
